const aiPioneersPersian = [
  {
    id: 1,
    img: "./images/alan.png",
    name: "آلن تورینگ",
    title: "دانشمند کامپیوتر",
    quote:
      "یک کامپیوتر شایسته است که هوش مصنوعی داشته باشد اگر بتواند انسان را فریب دهد و او را متقاعد کند که انسانی است.",
  },
  {
    id: 2,
    img: "./images/grace.jpg",
    name: "گریس هاپر",
    title: "دانشمند کامپیوتر و کمدور نیروی دریایی ایالات متحده",
    quote:
      'خطرناک‌ترین عبارت در زبان این است: "ما همیشه به این روش انجام می‌دهیم."',
  },
  {
    id: 3,
    img: "./images/john.JPEG",
    name: "جان مک‌کارتی",
    title: "دانشمند کامپیوتر",
    quote:
      "هوش مصنوعی علمی است که ماشین‌ها را قادر می‌سازد کارهایی انجام دهند که اگر انسان‌ها انجام دهند، نیاز به هوش دارند.",
  },
  {
    id: 5,
    img: "./images/marvin.jpeg",
    name: "ماروین منسکی",
    title: "دانشمند شناختی",
    quote:
      "شما هیچ چیز را نمی‌فهمید تا زمانی که آن را بیش از یک روش یاد نگرفته باشید.",
  },
  {
    id: 6,
    img: "./images/yann.jpg",
    name: "یان لوکان",
    title: "دانشمند کامپیوتر و پژوهشگر هوش مصنوعی",
    quote:
      "یادگیری عمیق مانند موتور موشک است؛ اگر به درستی استفاده نشود بسیار قدرتمند و خطرناک است.",
  },
  {
    id: 7,
    img: "./images/fei-fei.jpg",
    name: "فی-فی لی",
    title: "دانشمند کامپیوتر و استاد دانشگاه",
    quote:
      "هوش مصنوعی به هیچ وجه مصنوعی نیست - این در واقع آینه‌ای از تنوع و تفکر انسانی است.",
  },
  {
    id: 19,
    img: "./images/tenenbaum.jpg",
    name: "جوشوا تننباوم",
    title: "استاد علوم شناختی و محاسباتی",
    quote:
      "ما واقعاً در آغاز درک آن هستیم که هوش مصنوعی به سطح هوش انسانی و سطح مشترک انسانی چه معنا دارد.",
  },
  {
    id: 8,
    img: "./images/andrew.jpg",
    name: "آندرو انگ",
    title: "دانشمند کامپیوتر و آموزش‌دهنده هوش مصنوعی",
    quote:
      "هوش مصنوعی مانند برق جدید است. همانطور که برق صنایع را در گذشته تغییر داد، هوش مصنوعی نیز در آینده این کار را خواهد کرد.",
  },
  {
    id: 9,
    img: "./images/kurzweil.jpg",
    name: "ری کورزوایل",
    title: "آینده‌پژوه و مخترع",
    quote:
      "آینده به طور گسترده‌ای اشتباه متوجه می‌شود. اجداد ما انتظار داشتند که آینده تقریباً مانند حال آن‌ها باشد که تقریباً مانند گذشته آن‌ها بوده است.",
  },
  {
    id: 4,
    img: "./images/elon.jpg",
    name: "ایلون ماسک",
    title: "مدیرعامل اسپیس‌ایکس و تسلا، شرکت موتور خودروهای برقی",
    quote:
      "من فکر می‌کنم باید به هوش مصنوعی بسیار مراقب باشیم. اگر بخواهم حدس بزنم کدام یک از بزرگ‌ترین تهدیدهای موجودیت ماست، احتمالاً همین است.",
  },
  {
    id: 10,
    img: "./images/demis.jpg",
    name: "دمیس حسابیس",
    title: "موسس شرکت دیپ‌مایند",
    quote:
      "من فکر می‌کنم هوش مصنوعی بهترین یا بدترین چیزی خواهد بود که تاکنون برای بشر اتفاق افتاده است، بنابراین بیایید مطمئن شویم که بهترین باشد.",
  },
  {
    id: 11,
    img: "./images/yoshua.jpg",
    name: "یوشوا بنجیو",
    title: "دانشمند کامپیوتر و پژوهشگر هوش مصنوعی",
    quote:
      "هوش مصنوعی در واقع در مورد ساخت یک ذهن نیست؛ بلکه در مورد ساخت یک ابزار است.",
  },
  {
    id: 12,
    img: "./images/geoffrey.jpg",
    name: "جفری هینتون",
    title: "دانشمند کامپیوتر و پژوهشگر هوش مصنوعی",
    quote:
      "فکر می‌کنم یکی از ویژگی‌های مشترک همه اشکال هوش این است که شما ساختار جهان را یاد می‌گیرید.",
  },
  {
    id: 18,
    img: "./images/chollet.jpg",
    name: "فرانسوا چوله",
    title: "دانشمند کامپیوتر و پژوهشگر یادگیری عمیق",
    quote:
      "یادگیری عمیق به عنوان یک ابزار مفیدی در اختیار انسان‌ها می‌آید که به آن‌ها در ساخت سایر ابزارها کمک می‌کند.",
  },
  {
    id: 20,
    img: "./images/tegmark.jpg",
    name: "مکس تگمارک",
    title: "فیزیکدان و پژوهشگر هوش مصنوعی",
    quote:
      "جذاب‌ترین چیز این است که به دنبال چیزهایی باشیم که نمی‌دانستیم وجود دارند.",
  },
  // افراد بیشتری را با مسیر تصویر، نام، عنوان و نقل قول مشابه اضافه کنید...
];

export default aiPioneersPersian;
